In [2]:
import pandas as pd
import numpy as np

from sklearn.preprocessing import MinMaxScaler
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score

In [3]:
df = pd.read_csv("sales_pos.csv")
df.head(2)

,user,prod,gender,age_group,job,city,marital,prod_cat1,prod_cat2,prod_cat3,purchase
0,1,P00069042,F,0-17,10,A,0,3,NaN,NaN,8370
1,1,P00248942,F,0-17,10,A,0,1,6.0,14.0,15200

In [4]:
df.shape

(550068, 11)

### Q1.

In [5]:
df_q1 = df[["prod", "job", "purchase"]]
df_q1.head(2)

        prod  job  purchase
0  P00069042   10      8370
1  P00248942   10     15200

In [9]:
top_prod = df_q1.groupby("prod")["purchase"].sum().idxmax()
top_prod

'P00025442'

In [10]:
df_q1_sub = df_q1.loc[df_q1["prod"] == top_prod, ]
df_q1_sub.head(2)

          prod  job  purchase
667  P00025442   17     19706
749  P00025442    7     15212

In [12]:
df_q1_sub["job"].value_counts().idxmax()

4

### Q2.

In [13]:
df_sample = df.loc[df["user"] == 1, ["prod_cat1", "prod_cat2", "prod_cat3"]]
df_sample.head()

       prod_cat1  prod_cat2  prod_cat3
0              3        NaN        NaN
1              1        6.0       14.0
2             12        NaN        NaN
3             12       14.0        NaN
39180          2        4.0        8.0

In [14]:
len(df_sample)

35

In [18]:
# df_sample.fillna(0).drop_duplicates()
len(df_sample.fillna(0).drop_duplicates())

21

In [24]:
df_sample = df.loc[df["user"] == 1, ["prod_cat1", "prod_cat2", "prod_cat3"]]
df_sample = df_sample.fillna(0)
df_sample.head(2)

   prod_cat1  prod_cat2  prod_cat3
0          3        0.0        0.0
1          1        6.0       14.0

In [25]:
df_sample["prod_cat1"] = df_sample["prod_cat1"].astype("int").astype("str")
df_sample["prod_cat2"] = df_sample["prod_cat2"].astype("int").astype("str")
df_sample["prod_cat3"] = df_sample["prod_cat3"].astype("int").astype("str")

In [26]:
df_sample["prod_cat"] = df_sample["prod_cat1"] + "-" + df_sample["prod_cat2"] + "-" + df_sample["prod_cat3"]
df_sample.head()

      prod_cat1 prod_cat2 prod_cat3 prod_cat
0             3         0         0    3-0-0
1             1         6        14   1-6-14
2            12         0         0   12-0-0
3            12        14         0  12-14-0
39180         2         4         8    2-4-8

In [27]:
df_sample["prod_cat"].nunique()

21

In [28]:
df["age_group"].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [29]:
df_q2 = df.loc[df["age_group"] == "26-35", ]
df_q2 = df_q2[["user", "marital", "prod_cat1", "prod_cat2", "prod_cat3"]]
df_q2 = df_q2.reset_index(drop = True)
df_q2.head()

   user  marital  prod_cat1  prod_cat2  prod_cat3
0     3        0          1        2.0        NaN
1     5        1          8        NaN        NaN
2     5        1          5       11.0        NaN
3     5        1          8        NaN        NaN
4     5        1          8        NaN        NaN

In [31]:
df_q2 = df_q2.fillna(0)
df_q2["prod_cat1"] = df_q2["prod_cat1"].astype("int").astype("str")
df_q2["prod_cat2"] = df_q2["prod_cat2"].astype("int").astype("str")
df_q2["prod_cat3"] = df_q2["prod_cat3"].astype("int").astype("str")
df_q2["prod_cat" ] = df_q2.loc[:, "prod_cat1":"prod_cat3"].apply(lambda x: x.str.cat(sep = "-"),
                                                                 axis = 1)

In [ ]:
apply(lambda x: x.str.cat(sep = "-"), axis = 1)

In [32]:
df_q2.head()

   user  marital prod_cat1 prod_cat2 prod_cat3 prod_cat
0     3        0         1         2         0    1-2-0
1     5        1         8         0         0    8-0-0
2     5        1         5        11         0   5-11-0
3     5        1         8         0         0    8-0-0
4     5        1         8         0         0    8-0-0

In [35]:
# df_q2_agg = df_q2.groupby("user")["prod_cat"].nunique()
df_q2_agg = df_q2.groupby(["user", "marital"])["prod_cat"].nunique()
df_q2_agg = df_q2_agg.reset_index()
df_q2_agg.head(2)

   user  marital  prod_cat
0     3        0        18
1     5        1        43

In [36]:
df_q2_agg.groupby("marital")["prod_cat"].mean()

marital
0    41.663183
1    41.792336
Name: prod_cat, dtype: float64

In [39]:
df_q2_agg.groupby("marital")["prod_cat"].mean().diff().round(2)[1]

0.13

### Q3.

In [41]:
df_q3_user = df[["user", "gender", "age_group", "job", "city", "marital"]]
df_q3_user = df_q3_user.drop_duplicates().reset_index(drop = True)
df_q3_user.head(2)

   user gender age_group  job city  marital
0     1      F      0-17   10    A        0
1     2      M       55+   16    C        0

In [42]:
len(df_q3_user)

5891

In [43]:
df["user"].nunique()

5891

In [45]:
df_q3_agg1 = df.groupby("user")["prod"].nunique().reset_index()
df_q3_agg2 = df.groupby("user")["purchase"].sum().reset_index()
df_q3_agg1.head(2)

   user  prod
0     1    35
1     2    77

In [46]:
df_join = df_q3_user.merge(df_q3_agg1, on = "user")
df_join = df_join.merge(   df_q3_agg2, on = "user")
df_join.head()

   user gender age_group  job city  marital  prod  purchase
0     1      F      0-17   10    A        0    35    334093
1     2      M       55+   16    C        0    77    810472
2     3      M     26-35   15    A        0    29    341635
3     4      M     46-50    7    B        1    14    206468
4     5      M     26-35   20    A        1   106    821001

In [48]:
df_join["gender"] = df_join["gender"].replace({"M": 1, "F": 0})

In [57]:
age_u = pd.Series(df_join["age_group"].unique())
age_u = age_u.sort_values().reset_index(drop = True)
# age_u.to_dict()
age_u = pd.Series(age_u.index, index = age_u)
age_u.to_dict()

{'0-17': 0,
 '18-25': 1,
 '26-35': 2,
 '36-45': 3,
 '46-50': 4,
 '51-55': 5,
 '55+': 6}

In [58]:
age_g_new = df_join["age_group"].replace(age_u)

In [59]:
pd.crosstab(df_join["age_group"], age_g_new)

age_group    0     1     2     3    4    5    6
age_group
0-17       218     0     0     0    0    0    0
18-25        0  1069     0     0    0    0    0
26-35        0     0  2053     0    0    0    0
36-45        0     0     0  1167    0    0    0
46-50        0     0     0     0  531    0    0
51-55        0     0     0     0    0  481    0
55+          0     0     0     0    0    0  372

In [60]:
df_join["age_group"] = df_join["age_group"].replace(age_u)

In [61]:
df_join.head(2)

   user  gender  age_group  job city  marital  prod  purchase
0     1       0          0   10    A        0    35    334093
1     2       1          6   16    C        0    77    810472

In [63]:
# df_join_dum = pd.get_dummies(df_join)
df_join_dum = pd.get_dummies(df_join, columns = ["job", "city"])
df_join_dum.head(2)

,user,gender,age_group,marital,prod,purchase,job_0,job_1,job_2,job_3,...,job_14,job_15,job_16,job_17,job_18,job_19,job_20,city_A,city_B,city_C
0,1,0,0,0,35,334093,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,2,1,6,0,77,810472,0,0,0,0,...,0,0,1,0,0,0,0,0,0,1

In [64]:
df_join_dum = df_join_dum.iloc[:, 1:]
df_join_dum.head(2)

,gender,age_group,marital,prod,purchase,job_0,job_1,job_2,job_3,job_4,...,job_14,job_15,job_16,job_17,job_18,job_19,job_20,city_A,city_B,city_C
0,0,0,0,35,334093,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0
1,1,6,0,77,810472,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,1

In [65]:
df_join_nor = MinMaxScaler().fit_transform(df_join_dum)

In [69]:
model = KMeans(n_clusters = 7, random_state = 123)
model.fit(df_join_nor)
sil_score = silhouette_score(df_join_nor, labels = model.labels_)
sil_score

C:\Users\Encaion\anaconda3\lib\site-packages\sklearn\cluster\_kmeans.py:870: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  warnings.warn(

0.17924689113287728

In [72]:
round(sil_score, 2)

0.18

In [75]:
import sklearn
sklearn.__version__

'1.2.1'